# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке
# *Пример:*
# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да
# **Вывод:** Парам пам-пам

def count_russian_vowels(phrase: str) -> int:
    vowels = set(('а', 'о', 'е', 'ё', 'и', 'у', 'ы', 'я', 'ю', 'э'))
    count = 0
    for i in phrase:
        if i in vowels:
            count += 1
    return count


def same_by(characteristic, objects: object) -> bool:
    return len(set(map(characteristic, objects))) == 1


input_text = "пара-ра-рам рам-пам-папам па-ра-па-да"

if same_by(count_russian_vowels, input_text.split(' ')):
    print("Парам пам-пам")  # true
else:
    print("Пам парам")  # false
